Repository: HansvBug/Documate
Catalog: Documate/Resources/Models/AppDbCreate.*.resx
Languages: nl

# CheckAppDbVersion
source: Checking the application database version.
nl: Controle van de applicatie database versie.

# CreateAndOrUpdateTableReady
source: The creation/updating of the database (tables) is complete. (Version: {0})
nl: Het aanmaken / bijwerken van de database(tabellen) is gereed. (Versie: {0})

# CreateTableFailed
source: Failed to create table {0}. (Version {1}).
nl: Het aanmaken van de tabel {0} is mislukt. (Versie {1}).

# DbFileAlreadyExists
source: The application database is already present.
nl: De applicatie database is al aanwezig.

# EmptyDbFileCreated
source: An empty database file has been created.
nl: Een leeg database bestand is aangemaakt.

# ErrorDbConnection
source: There is no connection to the database.
nl: Er is geen connectie met de database.

# FailedToCreateDbFile
source: The application database has not been created.
nl: De applicatie database is niet aangemaakt.

# FailedToInsertDataIntoTabel
source: Failed to insert data into table {0}.
nl: Het invoeren van gegevens in de tabel {0} is mislukt.

# FailedToUpdateTable
source: Failed to change version in table {0}. (Version {1} ).
nl: Het wijzigen van de versie in tabel {0} is mislukt. (Versie {1} ).

# RequestMetaVersionFailed
source: Meta version request failed. (Version {1}).
nl: Opvragen meta versie is mislukt. (Versie {1}).

# RetrieveDbVersionError
source: Error retrieving database version.
nl: Fout bij ophalen database versie.

# RetrieveDbVersionErrorReturnDefault
source: Error retrieving database version. return version: -1
nl: Fout bij ophalen database versie. return versie: -1

# SetAutoVacuum
source: Database setting done: auto_vacuum = incremental.
nl: Database instelling gedaan: auto_vacuum = incremental.

# SetAutoVacuumFailed
source: Setting the database setting 'auto_vacuum = incremental' failed.
nl: Het zetten van de database instelling 'auto_vacuum = incremental' is mislukt.

# SetDbUserVersionIsReady
source: Database setting done: pragma USER_VERSION = {0}.
nl: Database instelling gedaan: pragma USER_VERSION = {0}.

# SetJournalMode
source: Database setting done: journal_mode = wal.
nl: Database instelling gedaan: journal_mode = wal.

# SetJournalModeFailed
source: Setting the database setting 'journal_mode = wal' failed.
nl: Het zetten van de database instelling 'journal_mode = wal' is mislukt.

# TableIsCreated
source: The table {0} has been created. (Version: {1}).
nl: De tabel {0} is aangemaakt. (Versie: {1}).

# TableIsUpdated
source: The table {0} has been updated.
nl: De tabel {0} is bijgewerkt.

# TableIsUpdatedWithVersion
source: The table {0} has been updated. (Version: {1}).
nl: De tabel {0} is bijgewerkt. (Versie: {1}).

# UnexpectedErrorCreDbFile
source: Unexpected error when creating an empty database file.
nl: Onverwachte fout bij het aanmaken van een leeg database bestand.

# UpdateDbUserVersionFailed
source: Setting up the database 'USER_VERSION' failed.
nl: Het instellen van de database 'USER_VERSION' is mislukt.

# UpdateVersionNumberFailed
source: Failed to enter the database version number in table {0}. (Version {1}).
nl: Het invoeren van het database versienummer in tabel {0} is mislukt. (Versie {1}).
